import React from 'react';
import Image from 'next/image';
import CardBoard from '../components/card_board';
import { MdOutlineArrowBackIos } from "react-icons/md";





export default function BoxBoardGamePage() {

    const goBack = () => {
        window.history.back();
    }


    return (
        <div className="p-10">

            <div className='absolute left-5 back-button'>
                <button onClick={goBack}> <MdOutlineArrowBackIos className="text-left" size={40}/> </button>
            </div>

            <div className="flex justify-center pb-10">
              <h1 className="font font-bold text-[25px] underline">BoardGame : WareWolf</h1>
            </div>

            <div className='flex flex-col items-center'>
                <iframe className="mb-10 rounded-lg" width="300" height="200" src="https://www.youtube.com/embed/d0OoxTyyaDw"></iframe>

                <label className='text-2xl font-bold pb-5 underline'>คำอธิบาย</label>

                <label className='h-screen overflow-y-auto'>เกมส์ล่าปริศนามนุษย์หมาป่า Ultimate Werewolfเป็นเกมส์แนวตัดตัวเลือกระหว่างผู้เล่น 2 ทีม คือทีมชาวบ้าน และมนุษย์หมาป่า ฝ่ายชาวบ้านจะไม่รู้ว่าใครเป็นมนุษย์หมาป่า และฝั่งหมาป่าต้องพยายามแฝงตัวค่อย ๆ กำจัดฝ่ายชาวบ้านไปทีละคน เพื่อชัยชนะ
                    ตัวเกมส์จะมี ผู้ดำเนินเกมส์ (ที่ไม่อยู่ฝ่ายใด) เป็นคนทำหน้าที่ดำเนินเกมส์ บอร์ดเกมส์
                    เกมส์สนุกๆเล่นกันได้หลายคน เหมาะเล่นในงานสังสรรค์ต่างๆ งานปาร์ตี้ หรือเกมส์วงเหล้า
                    ประเภทบอร์ดเกมส์ : ปาร์ตี้ 
                    เหมาะสำหรับผู้เล่นอายุตั้งแต่ : 8+ ปี
                    จำนวนผู้เล่น 5-75 คน
                    เวลาเล่นต่อเกมส์ ประมาณ 30-90 นาที
                    จำนวนการ์ด 75 ใบ
                    ขนาดซอง 63.5 x 88 mm.
                    ขนาดกล่องแพคเกจ ประมาณ 20 x 6 x 14 cm. 
                    วิธีการเล่น คู่มือเป็นภาษาอังกฤษ*
                    บอร์ดเกมส์ Werewolf จะทำการแบ่งผู้เล่นออกเป็น 2 ฝ่ายด้วยกันนั้นก็คือ Villagers และ Werewolves ซึ่งทั้ง 2 ฝ่ายจะมีจุดมุ่งหมายในการชนะที่แตกต่างกัน ในฝ่าย Villagers จะต้องตามหาตัว Werewolves ให้ได้ซึ่งถ้าหาได้ครบตามจำนวนเกมส์จะจบลงและ Villagers จะเป็นฝ่ายที่ชนะไปในทันที ส่วนทางด้าน Werewolves ก็ต้องต้องคอยหลบเลี่ยง, แฝงตัวให้แนบเนียนไปกับกลุ่มชาวบ้าน และทำการสังหารชาวบ้านให้ได้มากที่สุด ผู้เล่นที่เป็นหมาป่าจะใช้เวลาในช่วงกลางคืน เลือกเหยื่อเพื่อทำการสังหารทิ้ง โดยคนที่ทำหน้าที่เป็นผู้ดำเนินเกมส์จะเป็นคนขานชื่อ Role ต่างๆ เมื่อมีบทบาทที่ขานชื่อ ผู้เล่นถึงจะสามารถลืมตาได้ และผ่านการเล่นในช่วงกลางคืนจบลง ก็จะต่อในช่วงเช้า ซึ่งในช่วงเช้านี่เองผู้เล่นคนไหนที่ใช้ความสามารถพิเศษอะไรไว้ผลก็จะมาเกิดขึ้นในช่วงนี้ สำหรับคนที่ถูกหมาป่าเลือกสังหารก็จะตายลง การเล่นในตอนเช้าจะให้ผู้เล่นทุกคนทำการพูดคุยกัน เพื่อที่ในตอนท้ายสุดจะทำการเลือกผู้เล่นหนึ่งคนออกจากเกมส์ เมื่อผู้เล่นถูกเลือกให้ออกจากเกม ผู้เล่นคนนั้นจะต้องเปิดเผยการ์ดว่าตนเองได้รับบทเป็นอะไร ถ้าเป็นหมาป่าเกมส์จะจบลงและ Villagers จะเป็นผู้ชนะทันที ถ้าไม่ใช่ เกมส์จะวนการเล่นกลางวันกลางคืนไปเรื่อยๆ จนกว่าจะบรรลุเป้าหมายของแต่ละฝ่าย</label>

                </div>
        </div>
    );
}
